In [5]:
import pandas as pd
import numpy as np
import datetime

In [2]:
stocks = pd.read_csv('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/stocks.csv')
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [3]:
stocks.dtypes

Date       object
Close     float64
Volume      int64
Symbol     object
dtype: object

In [7]:
stocks['Date'] = pd.to_datetime(stocks['Date'])

In [8]:
stocks.dtypes

Date      datetime64[ns]
Close            float64
Volume             int64
Symbol            object
dtype: object

### Indices comunes

In [10]:
stocks.index

RangeIndex(start=0, stop=9, step=1)

### Crear una Serie de multiindice con groupby

In [14]:
# Para crear una serie de multiindice, lo que hacemos es agrupar con "groupby", pero utilizando dos variables
# la primera variable que seleccionemos sera el indice principal
ser = stocks.groupby(['Symbol', 'Date']).Close.mean()

In [15]:
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [16]:
ser.index

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

### Desclasificar/desapilar el multi indice con "unstack()" para volverlo un data frame

In [17]:
ser.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

### Hacer selecciones de elementos en el multi indice

In [18]:
# Podemos hacer selecciones con .loc
ser.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [19]:
# Y tambien selecciones de dos columnas, es decir, el indice principal y su subnivel
ser.loc['AAPL', '2016-10-03']

112.52

In [20]:
# Si queremos seleccionar todo el nivel superior, utilizamos .loc, pero el primer argumento son dos puntos ":"
# para indicar que queremos seleccionar todo
ser.loc[:, '2016-10-03']

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: Close, dtype: float64

In [21]:
df = ser.unstack()

In [22]:
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [24]:
# La selecciones en un data frame se hacen de la misma forma
df.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: AAPL, dtype: float64

### Uso del multi indice en un data frame

In [25]:
stocks

        Date   Close    Volume Symbol
0 2016-10-03   31.50  14070500   CSCO
1 2016-10-03  112.52  21701800   AAPL
2 2016-10-03   57.42  19189500   MSFT
3 2016-10-04  113.00  29736800   AAPL
4 2016-10-04   57.24  20085900   MSFT
5 2016-10-04   31.35  18460400   CSCO
6 2016-10-05   57.64  16726400   MSFT
7 2016-10-05   31.59  11808600   CSCO
8 2016-10-05  113.05  21453100   AAPL

### Crear el multi indice en un data frame con df.set_index()

In [26]:
# Para crear el multi indice en un data frame, debemos utilizar "set_index()" y dentro colocar dos columnas
stocks.set_index(['Symbol', 'Date'], inplace = True)

In [27]:
stocks

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [28]:
stocks.index

MultiIndex([('CSCO', '2016-10-03'),
            ('AAPL', '2016-10-03'),
            ('MSFT', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('MSFT', '2016-10-04'),
            ('CSCO', '2016-10-04'),
            ('MSFT', '2016-10-05'),
            ('CSCO', '2016-10-05'),
            ('AAPL', '2016-10-05')],
           names=['Symbol', 'Date'])

### Ordenar el indice con sort_index() para poder verlo de forma correcta

In [29]:
# El multi indice por defecto es creado sin orden, para ordenarlo debemos aplicar la funcion sort_index()
stocks.sort_index(inplace = True)
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

### Hacer selecciones de un multiindice de dataframe

In [30]:
# Podemos hacer selecciones con .loc
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

In [41]:
# Para hacer selecciones de dos columnas con .loc, debemos meter los indices en parentesis, debemos poner la coma y los
# dos puntos ":", porque sino puede dar error. En caso contrario deben incluirse los nombres de las columnas
stocks.loc[('AAPL', '2016-10-03'), :]

Close          112.52
Volume    21701800.00
Name: (AAPL, 2016-10-03 00:00:00), dtype: float64

In [34]:
# Si queremos podemos utilizar los dos indices y luego seleccionar una sola columna
stocks.loc[('AAPL', '2016-10-03'), 'Close']

112.52

In [37]:
# Podemos seleccionar dos indices de nivel superior, y uno de nivel inferior, para ello debemos meter una lista dentro
# de los parentesis, con los indices superiores
stocks.loc[(['AAPL', 'MSFT'], '2016-10-03'), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500

In [43]:
# De igual forma, podemos seleccionar una sola columna
stocks.loc[(['AAPL', 'MSFT'], '2016-10-03'), 'Close']

Symbol  Date
AAPL    2016-10-03    112.52
MSFT    2016-10-03     57.42
Name: Close, dtype: float64

In [44]:
# Tambien podemos escoger, un indice superior y dos subindices
stocks.loc[('AAPL', ['2016-10-03', '2016-10-04']), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800

In [46]:
# Para poder seleccionar todos los indices principales, pero solo dos o menos sub indices,
# debemos utilizar slice(None) en el indice principal
stocks.loc[(slice(None), ['2016-10-03', '2016-10-04']), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900